export const sofaMechanisms: string[] = [
    //
    "аккордеон",
    "клик-кляк",
    "дельфин",
    "еврокнижка",
    "тик-так",
    "выкатной",
    "пантограф",
    "французская раскладушка",
    "американская раскладушка",
    "итальянская раскладушка",
    "спартакус",
    "реклайнер",
    "пума",
    "трансформер",
    "поворотный механизм",
    "раздвижной механизм",
];

export const sofaFrameMaterials: string[] = [
    "массив дерева", // Натуральная древесина, например дуб, бук, сосна
    "ДСП", // Древесно-стружечная плита
    "МДФ", // Древесноволокнистая плита средней плотности
    "фанера", // Листы склеенного шпона
    "металл", // Стальной или алюминиевый каркас
    "пластик", // Прочный пластик для бюджетных моделей
    "ЛДСП", // Ламинированная древесно-стружечная плита
    "комбинированный", // Сочетание нескольких материалов (например, металл и дерево)
    "берёзовый шпон", // Гибкая альтернатива для отдельных деталей
    "осина", // Лёгкая и долговечная древесина
    "буковый массив", // Прочная древесина для премиум-класса
    "алюминий", // Лёгкий и устойчивый к коррозии материал
    "сталь", // Тяжёлый и надёжный материал
    "полиуретан", // Используется в комбинации с другими материалами
    "карбон", // Лёгкий и сверхпрочный материал для премиальных конструкций
];
